import React from 'react';

import styles from './index.module.scss';

const Component = () => {
  return (
    <div className={styles.frame2147223714}>
      <div className={styles.frame2147223708}>
        <div className={styles.frame2147223659}>
          <p className={styles.a}>اختبر المرحلة</p>
        </div>
        <p className={styles.a2}>ما هو الذكاء الأصطناعي؟</p>
      </div>
      <div className={styles.frame2147223713}>
        <div className={styles.frame2147223709}>
          <p className={styles.a3}>مقدمة</p>
          <div className={styles.frame2147223710}>
            <p className={styles.a4}>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
              النص من مولد النص العربي، حيث يمكنك أن تولد مثل هذا النص أو العديد من
              النصوص الأخرى إضافة إلى زيادة عدد الحروف التي يولدها التطبيق. إذا كنت
              تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربي زيادة عدد
              الفقرات كما تريد، النص لن يبدو مقسماً ولا يحوي أخطاءً لغوية، مولد النص
              العربي مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل في كثير من
              الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            </p>
            <p className={styles.a4}>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
              النص من مولد النص العربي، حيث يمكنك أن تولد مثل هذا النص أو العديد من
              النصوص الأخرى إضافة إلى زيادة عدد الحروف التي يولدها التطبيق. إذا كنت
              تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربي زيادة عدد
              الفقرات كما تريد، النص لن يبدو مقسماً ولا يحوي أخطاءً لغوية، مولد النص
              العربي مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل في كثير من
              الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            </p>
          </div>
        </div>
        <div className={styles.frame2147223712}>
          <p className={styles.a3}>مقدمة</p>
          <div className={styles.frame2147223711}>
            <p className={styles.a4}>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
              النص من مولد النص العربي، حيث يمكنك أن تولد مثل هذا النص أو العديد من
              النصوص الأخرى إضافة إلى زيادة عدد الحروف التي يولدها التطبيق. إذا كنت
              تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربي زيادة عدد
              الفقرات كما تريد، النص لن يبدو مقسماً ولا يحوي أخطاءً لغوية، مولد النص
              العربي مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل في كثير من
              الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            </p>
            <p className={styles.a4}>
              هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
              النص من مولد النص العربي، حيث يمكنك أن تولد مثل هذا النص أو العديد من
              النصوص الأخرى إضافة إلى زيادة عدد الحروف التي يولدها التطبيق. إذا كنت
              تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربي زيادة عدد
              الفقرات كما تريد، النص لن يبدو مقسماً ولا يحوي أخطاءً لغوية، مولد النص
              العربي مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل في كثير من
              الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}

export default Component;
